{
	"update_id": "d354f89a-5c8e-4bf6-826e-59f2b53882bb",
	"title": "2021-12 Cumulative Update for Windows Server, version 2004 for x64-based Systems (KB5008212)",
	"description": "Install this update to resolve issues in Windows. For a complete listing of the issues that are included in this update, see the associated Microsoft Knowledge Base article for more information. After you install this item, you may have to restart your computer.",
	"architecture": "AMD64",
	"classification": "SecurityUpdates",
	"supported_products": "WindowsServer,version1903andlater",
	"supported_languages": "all",
	"security_bulliten": "n/a",
	"msrc_severity": "Critical",
	"kb_article": "5008212",
	"more_info": "https://support.microsoft.com/help/5008212",
	"support_url": "https://support.microsoft.com/help/5008212",
	"supersedes": [
		"2021-06 Cumulative Update for Windows Server, version 2004 for x64-based Systems (KB5004476)",
		"2021-06 Cumulative Update for Windows Server, version 2004 for x64-based Systems (KB5004760)",
		"2021-10 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB5006738)",
		"2021-11 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB5007253)",
		"2021-08 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB5005101)",
		"2021-01 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB4598291)",
		"2021-09 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB5005611)",
		"2021-02 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB4601382)",
		"2020-11 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB4586853)",
		"2020-10 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB4580364)",
		"2020-08 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB4571744)",
		"2020-07 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB4568831)",
		"2021-04 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB5001391)",
		"2021-05 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB5003214)",
		"2021-03 Cumulative Update for Windows Server, version 2004 for x64-based Systems (KB5001649)",
		"2020-11 Cumulative Update for Windows Server, version 2004 for x64-based Systems (KB4594440)",
		"2021-03 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB5000842)",
		"2020-06 Cumulative Update for Windows Server, version 2004 for x64-based Systems (KB4567523)",
		"2021-03 Cumulative Update for Windows Server, version 2004 for x64-based Systems (KB5001567)",
		"2021-11 Cumulative Update for Windows Server, version 2004 for x64-based Systems (KB5007186)",
		"2020-09 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB4577063)",
		"2021-07 Cumulative Update Preview for Windows Server, version 2004 for x64-based Systems (KB5004296)"
	],
	"reboot_behavior": "Can request restart",
	"user_input": "No",
	"connectivity": "No",
	"uninstall_notes": "ThissoftwareupdatecanberemovedbyselectingViewinstalledupdatesintheProgramsandFeaturesControlPanel.",
	"uninstall_steps": "n/a",
	"last_modified": "12/14/2021"
}
